import React, {useEffect, useState} from 'react';
import s from './style.module.scss';
import './times.css'
import FlipClockCountdown from '@leenguyen/react-flip-clock-countdown';
import '@leenguyen/react-flip-clock-countdown/dist/index.css';
import {useMediaQuery} from "../../../hooks/useMediaQuery";
import g from "../../../assets/css/global.module.scss";
import useOutsideClick from "../../../hooks/useOutsideClick";

const FirstBlock = () => {
    const [isOpen, setIsOpen] = useState(false)
    const handleHeaderClick = (event) => {
        setIsOpen(true)

        event.stopPropagation();
    };
    return (
        <>
            {isOpen && <HeaderOpened setIsOpen={setIsOpen}/>}
            <div className={s.firstBlockContainer}>
                <div className={s.brandNameContainer} onClick={handleHeaderClick}>
                    <svg width="491" viewBox="0 0 491 120" fill="none" xmlns="http://www.w3.org/2000/svg">
                        <path fillRule="evenodd" clipRule="evenodd"
                              d="M470.003 103.543H459.623V65.5807C477.071 65.5807 473.979 62.2169 473.979 99.4588C473.979 102.582 473.096 103.543 470.003 103.543ZM464.924 49.9632H459.623V16.0851H471.329C473.537 26.657 472.654 31.7027 472.654 44.1967C472.654 48.5216 468.899 49.9632 464.924 49.9632ZM442.837 114.836C442.837 122.284 455.647 119.161 473.979 119.161C494.299 119.161 490.765 94.8936 490.765 75.4318C490.765 65.5807 486.348 60.2948 479.059 58.3726L484.581 54.5283C490.765 49.0021 488.335 38.4302 488.335 18.9683C488.335 -4.57812 464.482 0.467536 442.837 0.467536V114.836Z"
                              fill="white"/>
                        <path fillRule="evenodd" clipRule="evenodd"
                              d="M27.3874 103.543H15.6815V65.5804C34.676 65.5804 31.1421 63.1777 31.1421 99.4584C31.1421 102.582 30.2586 103.543 27.3874 103.543ZM28.4917 48.5212L15.6815 49.9628V16.0848C32.2464 16.0848 29.8169 13.6821 29.8169 41.5534C29.8169 43.2353 28.9335 47.3198 28.4917 48.5212ZM0 119.161C51.4618 119.161 46.8236 124.446 46.8236 71.1066C46.8236 63.4179 42.1854 59.8139 36.4429 58.3722C46.3819 49.0017 45.4984 60.2944 45.4984 20.1694C45.4984 -4.81871 22.5283 0.467193 0 0.467193V119.161Z"
                              fill="white"/>
                        <path fillRule="evenodd" clipRule="evenodd"
                              d="M129.87 98.0176C129.87 80.2376 128.103 29.7809 131.195 16.0855C153.723 16.0855 147.981 3.59148 147.981 99.4592C147.981 104.985 144.447 103.544 134.95 103.544C132.079 103.544 129.87 101.141 129.87 98.0176ZM114.188 18.9688V99.4592C114.188 122.525 132.079 119.161 146.656 119.161C157.257 119.161 163.662 112.193 163.662 100.661V16.0855C163.662 -3.37633 141.576 0.467953 128.545 0.467953C120.373 0.467953 114.188 9.59822 114.188 18.9688Z"
                              fill="white"/>
                        <path fillRule="evenodd" clipRule="evenodd"
                              d="M83.0445 56.9308H73.989V16.085C91.4374 16.085 88.3453 12.4809 88.3453 51.4046C88.3453 54.5282 86.1366 56.9308 83.0445 56.9308ZM58.5283 119.161C78.848 119.161 73.989 127.09 73.989 71.1068H81.7193L90.9956 119.161H105.131C104.91 110.511 95.1921 74.4706 96.0756 71.1068C99.8303 65.1 103.806 63.6584 103.806 52.8463C103.806 -5.53934 108.002 0.467402 58.5283 0.467402V119.161Z"
                              fill="white"/>
                        <path fillRule="evenodd" clipRule="evenodd"
                              d="M318.047 98.0171V20.1696C318.047 13.6823 332.403 13.6823 332.403 20.1696V99.4587C332.403 106.426 318.047 105.225 318.047 98.0171ZM302.586 18.9682V100.66C302.586 121.323 319.151 119.161 331.078 119.161C341.237 119.161 348.084 111.712 348.084 100.66V18.9682C348.084 -3.1366 330.857 0.467438 316.942 0.467438C307.666 0.467438 302.586 8.63663 302.586 18.9682Z"
                              fill="white"/>
                        <path fillRule="evenodd" clipRule="evenodd"
                              d="M410.369 103.544C403.964 103.544 401.313 104.505 401.313 99.4591V20.1701C401.313 13.2022 415.449 14.4036 415.449 21.6117V98.0175C415.449 101.141 413.461 103.544 410.369 103.544ZM385.632 16.0855V103.544C385.632 121.083 403.964 119.161 414.124 119.161C425.167 119.161 431.13 111.232 431.13 99.4591V20.1701C431.13 -2.4153 413.903 0.467901 399.988 0.467901C392.258 0.467901 385.632 7.67604 385.632 16.0855Z"
                              fill="white"/>
                        <path fillRule="evenodd" clipRule="evenodd"
                              d="M175.367 119.16H190.828V62.697L209.16 119.16H224.62C223.516 113.634 221.97 110.991 220.203 105.465L205.847 61.7359C205.184 57.6513 219.099 4.31136 220.866 0.467041H206.509C202.534 9.35703 195.245 47.56 191.932 55.2486L190.828 0.467041H175.367V119.16Z"
                              fill="white"/>
                        <path fillRule="evenodd" clipRule="evenodd"
                              d="M231.246 114.836C231.246 118.199 232.13 119.16 235.001 119.16H268.793V103.543H248.032V65.5802H266.143V49.9627H248.032V16.0846H268.793V0.467041H231.246V114.836Z"
                              fill="white"/>
                        <path fillRule="evenodd" clipRule="evenodd" d="M358.466 119.161H375.252V98.0173H358.466V119.161Z" fill="white"/>
                    </svg>
                </div>
                <div className={s.counterContainer}>
                    <div className={s.counter}>
                        <Clock/>
                    </div>
                </div>
            </div>
        </>
    );
};
export const Clock = () => {
    const isActive_1150 = useMediaQuery('(max-width: 1150px)');
    const isActive_837 = useMediaQuery('(max-width: 837px)');
    const isActive_515 = useMediaQuery('(max-width: 837px)');

    const adaptiveClock = () => {
        if (isActive_515) {
            return ({width: 40, height: 60, fontSize: 55})
        } else if (isActive_837 === true) {
            return ({width: 55, height: 130, fontSize: 80})
        } else if (isActive_1150 === true) {
            return ({width: 95, height: 170, fontSize: 120})
        } else {
            return ({width: 135, height: 210, fontSize: 160})
        }
    }
    return (
        <FlipClockCountdown
            to={'2023-04-01T00:00:00'}
            labelStyle={{fontSize: 20, fontWeight: 400, textTransform: 'uppercase'}}
            digitBlockStyle={adaptiveClock()}
            dividerStyle={{color: 'black', height: 2}}
            showSeparators={false}
            showLabels={false}
        >
            Finished!
        </FlipClockCountdown>
    )
}
export const HeaderOpened = ({setIsOpen}) => {
    const handleClickOutside = () => {
        setIsOpen(false)
    }
    const blockRef = useOutsideClick(handleClickOutside);
    return (
        <>
            <div className={s.headerOpenedContainer} ref={blockRef}>
                <div className={s.headerOpenedBody}>
                    <div className={s.headerOpenedLogoContainer}>
                        <svg width="179" height="44" viewBox="0 0 179 44" fill="none" xmlns="http://www.w3.org/2000/svg">
                            <path fillRule="evenodd" clipRule="evenodd"
                                  d="M171.046 37.6817H167.268V23.8662C173.618 23.8662 172.493 22.642 172.493 36.1952C172.493 37.332 172.171 37.6817 171.046 37.6817ZM169.197 18.1826H167.268V5.85352H171.528C172.332 9.70089 172.01 11.5371 172.01 16.084C172.01 17.6579 170.644 18.1826 169.197 18.1826ZM161.159 41.7914C161.159 44.5021 165.821 43.3653 172.493 43.3653C179.887 43.3653 178.601 34.5339 178.601 27.4512C178.601 23.8662 176.994 21.9425 174.341 21.243L176.351 19.8439C178.601 17.8328 177.717 13.9854 177.717 6.9028C177.717 -1.66634 169.036 0.1699 161.159 0.1699V41.7914Z"
                                  fill="white"/>
                            <path fillRule="evenodd" clipRule="evenodd"
                                  d="M9.96694 37.6819H5.70688V23.8663C12.6194 23.8663 11.3334 22.9919 11.3334 36.1954C11.3334 37.3321 11.0119 37.6819 9.96694 37.6819ZM10.3688 17.6581L5.70688 18.1827V5.85365C11.7353 5.85365 10.8511 4.97924 10.8511 15.1223C10.8511 15.7344 10.5296 17.2209 10.3688 17.6581ZM0 43.3655C18.7282 43.3655 17.0403 45.2891 17.0403 25.8774C17.0403 23.0793 15.3523 21.7677 13.2625 21.2431C16.8795 17.8329 16.558 21.9426 16.558 7.34013C16.558 -1.75365 8.19862 0.170023 0 0.170023V43.3655Z"
                                  fill="white"/>
                            <path fillRule="evenodd" clipRule="evenodd"
                                  d="M47.2625 35.671C47.2625 29.2004 46.6195 10.838 47.7448 5.85392C55.9434 5.85392 53.8536 1.30703 53.8536 36.1956C53.8536 38.2068 52.5675 37.6821 49.1112 37.6821C48.0663 37.6821 47.2625 36.8077 47.2625 35.671ZM41.5557 6.90319V36.1956C41.5557 44.5899 48.0663 43.3657 53.3713 43.3657C57.2295 43.3657 59.5605 40.83 59.5605 36.6328V5.85392C59.5605 -1.22873 51.5226 0.170298 46.7803 0.170298C43.8063 0.170298 41.5557 3.49303 41.5557 6.90319Z"
                                  fill="white"/>
                            <path fillRule="evenodd" clipRule="evenodd"
                                  d="M30.2218 20.7185H26.9263V5.85373C33.2762 5.85373 32.1509 4.54212 32.1509 18.7074C32.1509 19.8441 31.3471 20.7185 30.2218 20.7185ZM21.2998 43.3655C28.6946 43.3655 26.9263 46.2511 26.9263 25.8775H29.7396L33.1155 43.3655H38.2597C38.1793 40.2177 34.6427 27.1017 34.9642 25.8775C36.3306 23.6915 37.7774 23.1669 37.7774 19.2321C37.7774 -2.0159 39.3046 0.170104 21.2998 0.170104V43.3655Z"
                                  fill="white"/>
                            <path fillRule="evenodd" clipRule="evenodd"
                                  d="M115.746 35.6707V7.34011C115.746 4.97923 120.97 4.97923 120.97 7.34011V36.1954C120.97 38.7311 115.746 38.2939 115.746 35.6707ZM110.119 6.9029V36.6325C110.119 44.1524 116.148 43.3654 120.488 43.3654C124.185 43.3654 126.677 40.6548 126.677 36.6325V6.9029C126.677 -1.14159 120.408 0.170007 115.344 0.170007C111.968 0.170007 110.119 3.14298 110.119 6.9029Z"
                                  fill="white"/>
                            <path fillRule="evenodd" clipRule="evenodd"
                                  d="M149.343 37.6821C147.012 37.6821 146.048 38.0318 146.048 36.1956V7.34034C146.048 4.80458 151.192 5.24177 151.192 7.86498V35.6709C151.192 36.8077 150.469 37.6821 149.343 37.6821ZM140.341 5.85386V37.6821C140.341 44.0652 147.012 43.3657 150.71 43.3657C154.729 43.3657 156.899 40.4801 156.899 36.1956V7.34034C156.899 -0.879032 150.629 0.170236 145.565 0.170236C142.752 0.170236 140.341 2.79345 140.341 5.85386Z"
                                  fill="white"/>
                            <path fillRule="evenodd" clipRule="evenodd"
                                  d="M63.8203 43.3652H69.4468V22.8168L76.1182 43.3652H81.7447C81.3429 41.3541 80.7802 40.3923 80.1372 38.3811L74.9126 22.467C74.6714 20.9806 79.7353 1.56884 80.3783 0.1698H75.1537C73.7069 3.40508 71.0544 17.3081 69.8487 20.1062L69.4468 0.1698H63.8203V43.3652Z"
                                  fill="white"/>
                            <path fillRule="evenodd" clipRule="evenodd"
                                  d="M84.1562 41.7913C84.1562 43.0155 84.4778 43.3652 85.5227 43.3652H97.8206V37.6816H90.265V23.8661H96.8561V18.1825H90.265V5.85342H97.8206V0.1698H84.1562V41.7913Z"
                                  fill="white"/>
                            <path fillRule="evenodd" clipRule="evenodd" d="M130.454 43.3659H136.563V35.6711H130.454V43.3659Z" fill="white"/>
                        </svg>
                    </div>
                    <div className={s.headerOpenedTextBody}>
                        <h2 className={g.h2}>О бренде</h2>
                        <p>Сайт рыбатекст поможет дизайнеру, верстальщику, вебмастеру сгенерировать несколько абзацев более менее осмысленного текста рыбы на
                            русском языке, а начинающему оратору отточить навык публичных выступлений в домашних условиях</p>
                        <p>Сайт рыбатекст поможет дизайнеру, верстальщику, вебмастеру сгенерировать несколько абзацев более менее осмысленного текста рыбы на
                            русском языке, а начинающему оратору отточить навык публичных выступлений в домашних условиях</p>
                    </div>
                </div>
            </div>
        </>
    )
}
export default FirstBlock;
